roboime/STM32-F1-FreeRTOS/Src/main.cpp
	/* USER CODE BEGIN 5 */
	/* Infinite loop */
	osDelay(2000);

	HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);

	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4);
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);

	HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Start(&htim4, TIM_CHANNEL_ALL);

	HAL_TIM_Base_Start_IT(&htim1);


	int a=0;

	//Declarações--
	IO_Pin_STM32 nrf_nss(IO_Pin::IO_Pin_Mode_OUT, SPI2_NSS_GPIO_Port, SPI2_NSS_Pin);
	IO_Pin_STM32 nrf_ce(IO_Pin::IO_Pin_Mode_OUT,SPI2_CE_GPIO_Port,SPI2_CE_Pin);
	IO_Pin_STM32 nrf_irqn(IO_Pin::IO_Pin_Mode_IN, SPI2_IRQN_GPIO_Port,SPI2_IRQN_Pin);
	SPI_STM32 spinrf(hspi2, nrf_nss);
	NRF24L01P nrf(spinrf,nrf_nss,nrf_ce,nrf_irqn);
	//  Robo robo(nrf,id);
	a=nrf.SelfTest();
	nrf.Init();
	nrf.Config(); // configurações : DPL OK, ACK OK, ACK_NOT OK, POWER UP OK
	nrf.StartRX_ESB(channel, address + id, 32, 1);
	nrf.TxPackage_ESB(channel, address + id, 0,(uint8_t*) "TESTE", 5);
	while(nrf.Busy()){
		nrf.InterruptCallback();
	}
	nrf.StartRX_ESB(channel, address + id, 32, 1);
	////////////////////////////////////////////




	//TESTE

	//  a=nrf.SelfTest();
	//  nrf.TxReady();
	//  a=nrf.SelfTest();


	for(;;)/*Não entendi direito*/
	{
		//    osDelay(500);
		//  HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
		nrf.InterruptCallback();
		if(nrf.RxSize()){
			interruptReceive(&nrf);
			//robo.interruptAckPayload();
			last_packet_ms = GetLocalTime();
			controlbit = true;
		}
		if((GetLocalTime()-last_packet_ms)>100){
			controlbit = false;
		}
		/////
	}
	/* USER CODE END 5 */
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){

	static int16_t m0p=0, m1p=0,old_c0=0,old_c1=0;

	//valor aproximado do raio da roda, em metros
	static const float R_roda = 0.030;
	static const float PI = 3.1415926;
	//valor do tempo em segundos
	static const float Tempo = 0.013;
	//número de divisões do encoder
	static const float ENC_DIV = 20;
	//para cada 75 giros do motor, a roda gira 1 vez
	static const float RED = 75;
	static float CALCULO = 0.0f;
	if(CALCULO==0.0f) CALCULO=(2*PI*R_roda/(Tempo*ENC_DIV*RED));
	static float speed_m0= 0.0f;
	static float speed_m1= 0.0f;
	static float e_m0 =0.0f,e_m1=0.0f;
	static float pwm_m0 =0.0f,pwm_m1=0.0f;
	float kp=70.0f;
	//SPI
	static float dado;

	if(htim==&htim1){
		static uint8_t i=0;
		//motor 0
		//	estava assim antes	m0p=(int16_t)(htim2.Instance->CNT), acredito que esteja trocado;
		m0p=(int16_t)(htim4.Instance->CNT);

		//motor 1
		//	estava assim antes	m2p=(int16_t)(htim4.Instance->CNT), acredito que esteja trocado;
		m1p=(int16_t)(htim2.Instance->CNT);
		if(controlbit){
			if(i% 13==1){
				if(pwm_m0>=0.0f){
					HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_RESET);
				} else {
					HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_RESET);

				}

				if(pwm_m1>=0.0f){
					HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_RESET);
				} else {
					HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_RESET);
				}
			}
		} else {
			HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);
		}

		//primeiro testa e depois incrementa
		if(i++% 13==0){
			i=1;
			speed_m0= CALCULO*((int16_t)(m0p-old_c0));
			speed_m1= CALCULO*((int16_t)(m1p-old_c1));

			e_m0= velocidade_des0-speed_m0;
			pwm_m0+=e_m0*kp;
			if(pwm_m0>1000.0f)
				pwm_m0=1000.0f;
			if(pwm_m0<-1000.0f)
				pwm_m0=-1000.0f;
			if(pwm_m0>=0.0f){
				htim1.Instance->CCR1=0;
				htim1.Instance->CCR2=(uint16_t)pwm_m0;
			} else {
				htim1.Instance->CCR1=(uint16_t)(-pwm_m0);
				htim1.Instance->CCR2=0;
			}


			e_m1= velocidade_des1-speed_m1;
			pwm_m1-=e_m1*kp;
			if(pwm_m1>1000.0f)
				pwm_m1=1000.0f;
			if(pwm_m1<-1000.0f)
				pwm_m1=-1000.0f;
			if(pwm_m1>=0.0f){
				htim3.Instance->CCR3=0;
				htim3.Instance->CCR4=(uint16_t)pwm_m1;
			} else {
				htim3.Instance->CCR3=(uint16_t)(-pwm_m1);
				htim3.Instance->CCR4=0;
			}

			old_c0=m0p;
			old_c1=m1p;
		}

	}
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  Noneb
 * @retval None
 */
void _Error_Handler(char * file, int line)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while(1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
